yade-trunk/examples/openfoam/terminalVelocity/system/blockMeshDict

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (0.01 0. 0)
    (0.01 0.02 0)
    (0 0.02 0)
    (0 0 0.01)
    (0.01 0 0.01)
    (0.01 0.02 0.01)
    (0 0.02 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (5 10 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (2 3 6 7)
        );
    }


    bottom
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }



    inlet
    {
        type patch;
        faces
        (
            (4 7 3 0)
        );
    }


    outlet
    {
        type patch;
        faces
        (
            (5 1 2 6)
        );
    }


    front
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }


    back
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }




);

mergePatchPairs
(
);

// ************************************************************************* //
